[[{"componentName":"header","dynamicSourcePath":"collections/categories"},"0-header"],[{"title":"This shrimp is awesome","content":["<h1>Badass</h1>","<p>Mantis shrimps, or stomatopods, are marine crustaceans of the order Stomatopoda. Some species have specialised calcified &quot;clubs&quot; that can strike with <strong>great power</strong>, while others have sharp forelimbs used to capture prey. They branched from other members of the class Malacostraca around 340 million years ago. Mantis shrimps typically grow to around 10 cm (3.9 in) in length. A few can reach up to 38 cm (15 in). The largest mantis shrimp ever caught had a length of 46 cm (18 in); it was caught in the Indian River near Fort Pierce, Florida, in the United States. A mantis shrimp's carapace (the bony, thick shell that covers crustaceans and some other species) covers only the rear part of the head and the first four segments of the thorax. Varieties range in color from shades of brown to vivid colors, with more than 450 species of mantis shrimps being known. They are among the most important predators in many shallow, tropical and subtropical marine habitats. However, despite being common, they are poorly understood, as many species spend most of their lives tucked away in burrows and holes.</p>","<p>Called &quot;sea locusts&quot; by ancient Assyrians, &quot;prawn killers&quot; in Australia, and now sometimes referred to as &quot;thumb splitters&quot;—because of the animal's ability to inflict painful gashes if handled incautiously—mantis shrimps have powerful claws that are used to attack and kill prey by spearing, stunning, or dismembering.</p>","<p>Mantis shrimps have, like mantis, ravishing legs. But theirs are so resilient that they inspire the military to make the armor of the future. Above all, their speed and striking power are the responsibility of the superpowers. As the comic book The Oatmeal recounts, the squid's ravishing legs move at the speed of a bullet fired by a 22 caliber and can strike a prey in 1/3000 of a second, with a force of 1,500 Newtons. One tenth of that speed, deployed by a human arm, &quot;would be enough to send a baseball into orbit.&quot;</p>","<p>A speed such as it boils water around ravishing legs and creates a shock wave capable of killing a prey missed by the strike.</p>","<p>Kept in an aquarium, crustaceans make carnage by dismembering and devouring crabs, shrimps, octopuses, snails and shells (whose shells they break). They would even be able to break the windows of overly fragile aquariums.</p>","<p>Oct 8th 20</p>",""],"slug":"/articles/this-shrimp-is-awesome","updatedAt":"2022-02-10T13:55:33.152Z","componentName":"article","image":{"name":"this_shrimp_is_awesome_adfcc714f2.jpg","alternativeText":"this_shrimp_is_awesome_adfcc714f2.jpg","caption":"this_shrimp_is_awesome_adfcc714f2.jpg","width":1200,"height":630,"formats":{"thumbnail":{"name":"thumbnail_this_shrimp_is_awesome_adfcc714f2.jpg","hash":"thumbnail_this_shrimp_is_awesome_adfcc714f2_b5cf09499d","ext":".jpg","mime":"image/jpeg","width":245,"height":129,"size":9.61,"url":"/uploads/thumbnail_this_shrimp_is_awesome_adfcc714f2_b5cf09499d.jpg"},"large":{"name":"large_this_shrimp_is_awesome_adfcc714f2.jpg","hash":"large_this_shrimp_is_awesome_adfcc714f2_b5cf09499d","ext":".jpg","mime":"image/jpeg","width":1000,"height":525,"size":73.02,"url":"/uploads/large_this_shrimp_is_awesome_adfcc714f2_b5cf09499d.jpg"},"medium":{"name":"medium_this_shrimp_is_awesome_adfcc714f2.jpg","hash":"medium_this_shrimp_is_awesome_adfcc714f2_b5cf09499d","ext":".jpg","mime":"image/jpeg","width":750,"height":394,"size":48.56,"url":"/uploads/medium_this_shrimp_is_awesome_adfcc714f2_b5cf09499d.jpg"},"small":{"name":"small_this_shrimp_is_awesome_adfcc714f2.jpg","hash":"small_this_shrimp_is_awesome_adfcc714f2_b5cf09499d","ext":".jpg","mime":"image/jpeg","width":500,"height":263,"size":26.86,"url":"/uploads/small_this_shrimp_is_awesome_adfcc714f2_b5cf09499d.jpg"}},"hash":"this_shrimp_is_awesome_adfcc714f2_b5cf09499d","ext":".jpg","mime":"image/jpeg","size":95.42,"url":"/uploads/this_shrimp_is_awesome_adfcc714f2_b5cf09499d.jpg","updatedAt":"2022-02-09T09:08:56.603Z"},"categories":[{"name":"Story","updatedAt":"2022-02-10T14:43:23.661Z","slug":"/categories/story"}],"author":{"name":"David Doe","info":"Professional Writer","updatedAt":"2022-02-09T08:56:19.417Z","slug":"authors/david-doe"}},"1-article"],[{"componentName":"footer"},"2-footer"]]